{
  "Rendering": "процесс создания или обновления пользовательского интерфейса на основе данных приложения и логики.",
  "Initial Rendering": "первичный рендеринг, выполняемый при загрузке приложения.",
  "Re-Rendering": "повторный рендеринг, вызываемый изменением состояния или свойств.",
  "Virtual DOM": "абстрактное представление дерева DOM, используемое в React для минимизации манипуляций с реальным DOM.",
  "Diffing Algorithm": "алгоритм сравнения текущего и нового Virtual DOM для определения необходимых изменений.",
  "Reactive Updates": "механизм, при котором изменение данных автоматически инициирует обновление интерфейса.",
  "Bindings": "связи между данными и интерфейсом, обеспечивающие автоматическое обновление.",
  "State Management": "механизмы хранения и обработки состояния приложения.",
  "State": "данные, влияющие на рендеринг компонента.",
  "Props": "данные, передаваемые в компонент от родителя.",
  "Context API (React)": "встроенный механизм для передачи состояния между компонентами без пропсов.",
  "Reconciliation": "процесс определения минимального набора изменений, необходимых для синхронизации интерфейса с Virtual DOM (в React).",
  "Hydration": "процесс преобразования статически отрендеренной HTML-страницы в интерактивное приложение. Применяется для серверного рендеринга (SSR).",
  "Server-Side Rendering (SSR)": "метод рендеринга, при котором HTML генерируется на сервере и отправляется в браузер.",
  "Client-Side Rendering (CSR)": "метод рендеринга, при котором HTML создается на стороне клиента с использованием JavaScript.",
  "Time to Interactive (TTI)": "время, за которое страница становится полностью интерактивной для пользователя.",
  "First Contentful Paint (FCP)": "момент времени, когда браузер впервые отображает текст или изображение.",
  "Frames Per Second (FPS)": "частота кадров, показывающая, насколько плавно работает интерфейс. Цель – 60 FPS.",
  "Runtime Overhead": "издержки, связанные с выполнением фреймворка во время работы приложения.",
  "Performance metrics": "это показатели, используемые для оценки и измерения скорости, отзывчивости и общей производительности веб-приложений или сайтов.",
  "Reactive Declarations (Svelte)": " особенность Svelte, позволяющая автоматически пересчитывать значения переменных, зависящих от других."  
}